spring-ws/src/test/resources/test.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:b="http://aleksandr0412.com/spring-ws/bookstore">
    <soapenv:Header/>
    <soapenv:Body>
        <b:getAllBooksRequest/>
    </soapenv:Body>
</soapenv:Envelope>

----------------------------------------------------------------------------------------

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:b="http://aleksandr0412.com/spring-ws/bookstore">
    <soapenv:Header/>
    <soapenv:Body>
        <b:getBookByIdRequest>
            <b:id>1</b:id>
        </b:getBookByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>

